In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]

In [4]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [17]:
# List Comprehension, concatena a string Linha com a range do tamanho da variável 's' que  é do tipo Series
index = ['Linha' + str(i) for i in range(len(s))]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [18]:
# Index da Series alterada com a list comprehension index
s = pd.Series(data, index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [19]:
# List comprehension em um dicionário, a chave contcatena 'linha' com range de s, valor é range de s + 1
data = {'Linha' + str(i): i + 1 for i in range(len(s))}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [20]:
# Transforma o dicionário em uma Series
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [21]:
# Soma + 2 o valor da series
s1 = s + 2
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [22]:
# soma a o valor da series original com a series(adicionado + 2 anteriormente)
s2 = s +s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# Data Frame

In [23]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [25]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [26]:
# Sequencia para alterar o index
index = ['Linha' + str(i) for i in range(len(df1))]
index

['Linha0', 'Linha1', 'Linha2']

In [29]:
# Index alterado 
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [34]:
# Ler a quantidade de elementos na coluna 0 e concatenando para criar o nome das colunas
columns = ['Coluna' + str(c) for c in range(len(df1[0]))]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [35]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [38]:
'''Um dicionário onde a chave representa a coluna, e o valor da chave coluna é um dicionário com chaves que representam
   as linhas e seus respectivos valores '''
data = {'Coluna0':{'Linha0': 1, 'Linha1': 2, 'Linha2': 3},
       'Coluna1':{'Linha0': 4, 'Linha1': 5, 'Linha2': 6},
        'Coluna2':{'Linha0': 7, 'Linha1': 8, 'Linha2': 9}}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 2, 'Linha2': 3},
 'Coluna1': {'Linha0': 4, 'Linha1': 5, 'Linha2': 6},
 'Coluna2': {'Linha0': 7, 'Linha1': 8, 'Linha2': 9}}

In [40]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        4        7
Linha1        2        5        8
Linha2        3        6        9

In [41]:
# DataFrame com tuplas
df3 = [(1, 2, 3),
        (4, 5, 6),
        (7, 8, 9)]
df3

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [42]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        4        7
Linha1        2        5        8
Linha2        3        6        9

# Concatenando tabelas

In [43]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [44]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [46]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [47]:
# DataFrame concatenado com 3 tabelas em sequencia um em baixo do outro
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [48]:
# Concatenando um do lado do outro
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C